nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f81000evk/driver_examples/queued_spi/polling_b2b_transfer/slave/pin_mux.h
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define GPIO_PUR_PU_10_MASK 0x0400u /*!<@brief Pull Resistor Enable Bits Mask for item 10. */
#define GPIO_PUR_PU_6_MASK 0x40u    /*!<@brief Pull Resistor Enable Bits Mask for item 6. */
#define GPIO_PUR_PU_8_MASK 0x0100u  /*!<@brief Pull Resistor Enable Bits Mask for item 8. */
#define GPIO_PUR_PU_9_MASK 0x0200u  /*!<@brief Pull Resistor Enable Bits Mask for item 9. */
#define PUR_PU_10_ENABLED 0x0400u   /*!<@brief Pull Resistor Enable Bits: Pull resistor is enabled */
#define PUR_PU_6_ENABLED 0x40u      /*!<@brief Pull Resistor Enable Bits: Pull resistor is enabled */
#define PUR_PU_8_ENABLED 0x0100u    /*!<@brief Pull Resistor Enable Bits: Pull resistor is enabled */
#define PUR_PU_9_ENABLED 0x0200u    /*!<@brief Pull Resistor Enable Bits: Pull resistor is enabled */

/*! @name GPIOC1 (number 4), Y1[3]/XTAL
  @{ */
#define BOARD_XTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_XTAL_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BOARD_XTAL_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOC11 (number 37), U16[25]/TXD1
  @{ */
#define BOARD_TXD1_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_TXD1_PIN 11U              /*!<@brief GPIOC pin index: 11 */
#define BOARD_TXD1_PIN_MASK kGPIO_Pin11 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC12 (number 38), U16[26]/RXD1
  @{ */
#define BOARD_RXD1_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_RXD1_PIN 12U              /*!<@brief GPIOC pin index: 12 */
#define BOARD_RXD1_PIN_MASK kGPIO_Pin12 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC8 (number 33), J2[10]/U13[2]/MISO0
  @{ */
#define BOARD_MISO0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_MISO0_PIN 8U              /*!<@brief GPIOC pin index: 8 */
#define BOARD_MISO0_PIN_MASK kGPIO_Pin8 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC9 (number 34), J2[12]/U13[6]/SCK0
  @{ */
#define BOARD_SCK0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_SCK0_PIN 9U              /*!<@brief GPIOC pin index: 9 */
#define BOARD_SCK0_PIN_MASK kGPIO_Pin9 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOC10 (number 35), J2[8]/U13[5]/MOSI0/XB_OUT9
  @{ */
#define BOARD_MOSI0_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_MOSI0_PIN 10U              /*!<@brief GPIOC pin index: 10 */
#define BOARD_MOSI0_PIN_MASK kGPIO_Pin10 /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name GPIOC7 (number 32), J1[14]/U13[1]/SS0/XB_OUT6
  @{ */
#define BOARD_SS0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_SS0_PIN 7U              /*!<@brief GPIOC pin index: 7 */
#define BOARD_SS0_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
